espressif/esp-idf/components/soc/esp32s31/register/soc/bitscrambler_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** BITSCRAMBLER_TX_INST_CFG0_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_TX_INST_CFG0_REG (DR_REG_BITSCRAMBLER_BASE + 0x0)
/** BITSCRAMBLER_TX_INST_IDX : R/W; bitpos: [2:0]; default: 0;
 *  write this bits to specify the one of 8 instruction
 */
#define BITSCRAMBLER_TX_INST_IDX    0x00000007U
#define BITSCRAMBLER_TX_INST_IDX_M  (BITSCRAMBLER_TX_INST_IDX_V << BITSCRAMBLER_TX_INST_IDX_S)
#define BITSCRAMBLER_TX_INST_IDX_V  0x00000007U
#define BITSCRAMBLER_TX_INST_IDX_S  0
/** BITSCRAMBLER_TX_INST_POS : R/W; bitpos: [6:3]; default: 0;
 *  write this bits to specify the bit position of 257 bit instruction which in units
 *  of 32 bits
 */
#define BITSCRAMBLER_TX_INST_POS    0x0000000FU
#define BITSCRAMBLER_TX_INST_POS_M  (BITSCRAMBLER_TX_INST_POS_V << BITSCRAMBLER_TX_INST_POS_S)
#define BITSCRAMBLER_TX_INST_POS_V  0x0000000FU
#define BITSCRAMBLER_TX_INST_POS_S  3

/** BITSCRAMBLER_TX_INST_CFG1_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_TX_INST_CFG1_REG (DR_REG_BITSCRAMBLER_BASE + 0x4)
/** BITSCRAMBLER_TX_INST : R/W; bitpos: [31:0]; default: 4;
 *  write this bits to update instruction which specified by
 *  BITSCRAMBLER_TX_INST_CFG0_REG, Read this bits to get instruction which specified by
 *  BITSCRAMBLER_TX_INST_CFG0_REG
 */
#define BITSCRAMBLER_TX_INST    0xFFFFFFFFU
#define BITSCRAMBLER_TX_INST_M  (BITSCRAMBLER_TX_INST_V << BITSCRAMBLER_TX_INST_S)
#define BITSCRAMBLER_TX_INST_V  0xFFFFFFFFU
#define BITSCRAMBLER_TX_INST_S  0

/** BITSCRAMBLER_RX_INST_CFG0_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_RX_INST_CFG0_REG (DR_REG_BITSCRAMBLER_BASE + 0x8)
/** BITSCRAMBLER_RX_INST_IDX : R/W; bitpos: [2:0]; default: 0;
 *  write this bits to specify the one of 8 instruction
 */
#define BITSCRAMBLER_RX_INST_IDX    0x00000007U
#define BITSCRAMBLER_RX_INST_IDX_M  (BITSCRAMBLER_RX_INST_IDX_V << BITSCRAMBLER_RX_INST_IDX_S)
#define BITSCRAMBLER_RX_INST_IDX_V  0x00000007U
#define BITSCRAMBLER_RX_INST_IDX_S  0
/** BITSCRAMBLER_RX_INST_POS : R/W; bitpos: [6:3]; default: 0;
 *  write this bits to specify the bit position of 257 bit instruction which in units
 *  of 32 bits
 */
#define BITSCRAMBLER_RX_INST_POS    0x0000000FU
#define BITSCRAMBLER_RX_INST_POS_M  (BITSCRAMBLER_RX_INST_POS_V << BITSCRAMBLER_RX_INST_POS_S)
#define BITSCRAMBLER_RX_INST_POS_V  0x0000000FU
#define BITSCRAMBLER_RX_INST_POS_S  3

/** BITSCRAMBLER_RX_INST_CFG1_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_RX_INST_CFG1_REG (DR_REG_BITSCRAMBLER_BASE + 0xc)
/** BITSCRAMBLER_RX_INST : R/W; bitpos: [31:0]; default: 12;
 *  write this bits to update instruction which specified by
 *  BITSCRAMBLER_RX_INST_CFG0_REG, Read this bits to get instruction which specified by
 *  BITSCRAMBLER_RX_INST_CFG0_REG
 */
#define BITSCRAMBLER_RX_INST    0xFFFFFFFFU
#define BITSCRAMBLER_RX_INST_M  (BITSCRAMBLER_RX_INST_V << BITSCRAMBLER_RX_INST_S)
#define BITSCRAMBLER_RX_INST_V  0xFFFFFFFFU
#define BITSCRAMBLER_RX_INST_S  0

/** BITSCRAMBLER_TX_LUT_CFG0_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_TX_LUT_CFG0_REG (DR_REG_BITSCRAMBLER_BASE + 0x10)
/** BITSCRAMBLER_TX_LUT_IDX : R/W; bitpos: [10:0]; default: 0;
 *  write this bits to specify the bytes position of LUT RAM based on
 *  reg_bitscrambler_tx_lut_mode
 */
#define BITSCRAMBLER_TX_LUT_IDX    0x000007FFU
#define BITSCRAMBLER_TX_LUT_IDX_M  (BITSCRAMBLER_TX_LUT_IDX_V << BITSCRAMBLER_TX_LUT_IDX_S)
#define BITSCRAMBLER_TX_LUT_IDX_V  0x000007FFU
#define BITSCRAMBLER_TX_LUT_IDX_S  0
/** BITSCRAMBLER_TX_LUT_MODE : R/W; bitpos: [12:11]; default: 0;
 *  write this bits to specify the bytes mode of LUT RAM, 0: 1 byte,1: 2bytes, 2: 4
 *  bytes
 */
#define BITSCRAMBLER_TX_LUT_MODE    0x00000003U
#define BITSCRAMBLER_TX_LUT_MODE_M  (BITSCRAMBLER_TX_LUT_MODE_V << BITSCRAMBLER_TX_LUT_MODE_S)
#define BITSCRAMBLER_TX_LUT_MODE_V  0x00000003U
#define BITSCRAMBLER_TX_LUT_MODE_S  11

/** BITSCRAMBLER_TX_LUT_CFG1_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_TX_LUT_CFG1_REG (DR_REG_BITSCRAMBLER_BASE + 0x14)
/** BITSCRAMBLER_TX_LUT : R/W; bitpos: [31:0]; default: 20;
 *  write this bits to update LUT which specified by BITSCRAMBLER_TX_LUT_CFG0_REG, Read
 *  this bits to get LUT which specified by BITSCRAMBLER_TX_LUT_CFG0_REG
 */
#define BITSCRAMBLER_TX_LUT    0xFFFFFFFFU
#define BITSCRAMBLER_TX_LUT_M  (BITSCRAMBLER_TX_LUT_V << BITSCRAMBLER_TX_LUT_S)
#define BITSCRAMBLER_TX_LUT_V  0xFFFFFFFFU
#define BITSCRAMBLER_TX_LUT_S  0

/** BITSCRAMBLER_RX_LUT_CFG0_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_RX_LUT_CFG0_REG (DR_REG_BITSCRAMBLER_BASE + 0x18)
/** BITSCRAMBLER_RX_LUT_IDX : R/W; bitpos: [10:0]; default: 0;
 *  write this bits to specify the bytes position of LUT RAM based on
 *  reg_bitscrambler_rx_lut_mode
 */
#define BITSCRAMBLER_RX_LUT_IDX    0x000007FFU
#define BITSCRAMBLER_RX_LUT_IDX_M  (BITSCRAMBLER_RX_LUT_IDX_V << BITSCRAMBLER_RX_LUT_IDX_S)
#define BITSCRAMBLER_RX_LUT_IDX_V  0x000007FFU
#define BITSCRAMBLER_RX_LUT_IDX_S  0
/** BITSCRAMBLER_RX_LUT_MODE : R/W; bitpos: [12:11]; default: 0;
 *  write this bits to specify the bytes mode of LUT RAM, 0: 1 byte,1: 2bytes, 2: 4
 *  bytes
 */
#define BITSCRAMBLER_RX_LUT_MODE    0x00000003U
#define BITSCRAMBLER_RX_LUT_MODE_M  (BITSCRAMBLER_RX_LUT_MODE_V << BITSCRAMBLER_RX_LUT_MODE_S)
#define BITSCRAMBLER_RX_LUT_MODE_V  0x00000003U
#define BITSCRAMBLER_RX_LUT_MODE_S  11

/** BITSCRAMBLER_RX_LUT_CFG1_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_RX_LUT_CFG1_REG (DR_REG_BITSCRAMBLER_BASE + 0x1c)
/** BITSCRAMBLER_RX_LUT : R/W; bitpos: [31:0]; default: 28;
 *  write this bits to update LUT which specified by BITSCRAMBLER_RX_LUT_CFG0_REG, Read
 *  this bits to get LUT which specified by BITSCRAMBLER_RX_LUT_CFG0_REG
 */
#define BITSCRAMBLER_RX_LUT    0xFFFFFFFFU
#define BITSCRAMBLER_RX_LUT_M  (BITSCRAMBLER_RX_LUT_V << BITSCRAMBLER_RX_LUT_S)
#define BITSCRAMBLER_RX_LUT_V  0xFFFFFFFFU
#define BITSCRAMBLER_RX_LUT_S  0

/** BITSCRAMBLER_TX_TAILING_BITS_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_TX_TAILING_BITS_REG (DR_REG_BITSCRAMBLER_BASE + 0x20)
/** BITSCRAMBLER_TX_TAILING_BITS : R/W; bitpos: [15:0]; default: 0;
 *  write this bits to specify the extra data bit length after getting EOF
 */
#define BITSCRAMBLER_TX_TAILING_BITS    0x0000FFFFU
#define BITSCRAMBLER_TX_TAILING_BITS_M  (BITSCRAMBLER_TX_TAILING_BITS_V << BITSCRAMBLER_TX_TAILING_BITS_S)
#define BITSCRAMBLER_TX_TAILING_BITS_V  0x0000FFFFU
#define BITSCRAMBLER_TX_TAILING_BITS_S  0

