espressif/esp-idf/components/soc/esp32s31/register/soc/bitscrambler_reg.h
/** BITSCRAMBLER_RX_CNT_CFG_REG register
 *  RX Counter cfg registers
 */
#define BITSCRAMBLER_RX_CNT_CFG_REG (DR_REG_BITSCRAMBLER_BASE + 0x3c)
/** BITSCRAMBLER_TX_CNT_A_CFG_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  config the rx counter a value
 */
#define BITSCRAMBLER_TX_CNT_A_CFG_VALUE    0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_A_CFG_VALUE_M  (BITSCRAMBLER_TX_CNT_A_CFG_VALUE_V << BITSCRAMBLER_TX_CNT_A_CFG_VALUE_S)
#define BITSCRAMBLER_TX_CNT_A_CFG_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_A_CFG_VALUE_S  0
/** BITSCRAMBLER_TX_CNT_B_CFG_VALUE : R/W; bitpos: [31:16]; default: 0;
 *  config the rx counter b value
 */
#define BITSCRAMBLER_TX_CNT_B_CFG_VALUE    0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_B_CFG_VALUE_M  (BITSCRAMBLER_TX_CNT_B_CFG_VALUE_V << BITSCRAMBLER_TX_CNT_B_CFG_VALUE_S)
#define BITSCRAMBLER_TX_CNT_B_CFG_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_B_CFG_VALUE_S  16

/** BITSCRAMBLER_TX_CNT_STATE_REG register
 *  TX Counter state registers
 */
#define BITSCRAMBLER_TX_CNT_STATE_REG (DR_REG_BITSCRAMBLER_BASE + 0x40)
/** BITSCRAMBLER_RX_CNT_A_VALUE : RO; bitpos: [15:0]; default: 0;
 *  read the tx counter a value
 */
#define BITSCRAMBLER_RX_CNT_A_VALUE    0x0000FFFFU
#define BITSCRAMBLER_RX_CNT_A_VALUE_M  (BITSCRAMBLER_RX_CNT_A_VALUE_V << BITSCRAMBLER_RX_CNT_A_VALUE_S)
#define BITSCRAMBLER_RX_CNT_A_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_RX_CNT_A_VALUE_S  0
/** BITSCRAMBLER_RX_CNT_B_VALUE : RO; bitpos: [31:16]; default: 0;
 *  read the tx counter b value
 */
#define BITSCRAMBLER_RX_CNT_B_VALUE    0x0000FFFFU
#define BITSCRAMBLER_RX_CNT_B_VALUE_M  (BITSCRAMBLER_RX_CNT_B_VALUE_V << BITSCRAMBLER_RX_CNT_B_VALUE_S)
#define BITSCRAMBLER_RX_CNT_B_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_RX_CNT_B_VALUE_S  16

/** BITSCRAMBLER_RX_CNT_STATE_REG register
 *  RX Counter state registers
 */
#define BITSCRAMBLER_RX_CNT_STATE_REG (DR_REG_BITSCRAMBLER_BASE + 0x44)
/** BITSCRAMBLER_TX_CNT_A_VALUE : RO; bitpos: [15:0]; default: 0;
 *  read the rx counter a value
 */
#define BITSCRAMBLER_TX_CNT_A_VALUE    0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_A_VALUE_M  (BITSCRAMBLER_TX_CNT_A_VALUE_V << BITSCRAMBLER_TX_CNT_A_VALUE_S)
#define BITSCRAMBLER_TX_CNT_A_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_A_VALUE_S  0
/** BITSCRAMBLER_TX_CNT_B_VALUE : RO; bitpos: [31:16]; default: 0;
 *  read the rx counter b value
 */
#define BITSCRAMBLER_TX_CNT_B_VALUE    0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_B_VALUE_M  (BITSCRAMBLER_TX_CNT_B_VALUE_V << BITSCRAMBLER_TX_CNT_B_VALUE_S)
#define BITSCRAMBLER_TX_CNT_B_VALUE_V  0x0000FFFFU
#define BITSCRAMBLER_TX_CNT_B_VALUE_S  16

/** BITSCRAMBLER_SYS_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_SYS_REG (DR_REG_BITSCRAMBLER_BASE + 0xf8)
/** BITSCRAMBLER_LOOP_MODE : R/W; bitpos: [0]; default: 0;
 *  write this bit to set the bitscrambler tx loop back to DMA rx
 */
#define BITSCRAMBLER_LOOP_MODE    (BIT(0))
#define BITSCRAMBLER_LOOP_MODE_M  (BITSCRAMBLER_LOOP_MODE_V << BITSCRAMBLER_LOOP_MODE_S)
#define BITSCRAMBLER_LOOP_MODE_V  0x00000001U
#define BITSCRAMBLER_LOOP_MODE_S  0
/** BITSCRAMBLER_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Write this bit to enable the configuration register clock to be always-on. 0: turn
 *  on during access, 1: always-on.
 */
#define BITSCRAMBLER_CLK_EN    (BIT(31))
#define BITSCRAMBLER_CLK_EN_M  (BITSCRAMBLER_CLK_EN_V << BITSCRAMBLER_CLK_EN_S)
#define BITSCRAMBLER_CLK_EN_V  0x00000001U
#define BITSCRAMBLER_CLK_EN_S  31

/** BITSCRAMBLER_VERSION_REG register
 *  Control and configuration registers
 */
#define BITSCRAMBLER_VERSION_REG (DR_REG_BITSCRAMBLER_BASE + 0xfc)
/** BITSCRAMBLER_BITSCRAMBLER_VER : R/W; bitpos: [27:0]; default: 38801776;
 *  Reserved
 */
#define BITSCRAMBLER_BITSCRAMBLER_VER    0x0FFFFFFFU
#define BITSCRAMBLER_BITSCRAMBLER_VER_M  (BITSCRAMBLER_BITSCRAMBLER_VER_V << BITSCRAMBLER_BITSCRAMBLER_VER_S)
#define BITSCRAMBLER_BITSCRAMBLER_VER_V  0x0FFFFFFFU
#define BITSCRAMBLER_BITSCRAMBLER_VER_S  0

#ifdef __cplusplus
}
#endif
